src/Documents/ИнтерактивноеБронированиеТоваров/ИнтерактивноеБронированиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнтерактивноеБронированиеТоваров</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.БронированиеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
</mdclass:Document>

src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>КоличествоВСвободномОстатке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/БронированиеТоваров/БронированиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БронированиеТоваров</name>
  <resources>
    <name>КоличествоЗабронированного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ИнтерактивноеБронированиеТоваров/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Дата > ПолучитьОперативнуюОтметкуВремени() Тогда //Сравниваем введенную дату со временем на сервере
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя вводить документ будущей датой! >:(";
		Сообщение.Сообщить();
	КонецЕсли;
	
	//Очищаем в оперативной памяти старый набор записей
	Движения.СвободныеОстатки.Очистить();
	
	//Делаем инверсную копию движений по Свободным остаткам
	Для каждого ТекЗапись Из Движения.БронированиеТоваров Цикл
		//Копируем записи
		НовЗапись = Движения.СвободныеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(НовЗапись, ТекЗапись);
		//Инвертируем вид движения
		Если ТекЗапись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			НовЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			НовЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		//заполняем количество
		НовЗапись.КоличествоВСвободномОстатке = ТекЗапись.КоличествоЗабронированного;
	КонецЦикла;
	
	
КонецПроцедуры
